<html>
<head>
<title>Restore GRUB into the MBR - Rescapp - Documentation</title>
</head>
<body>
<h1>Restaurar GRUB en el MBR - Rescapp - Documentation</h1>
<p></p>

<ul>
  <li>
  <b>Paso 1</b><p></p>Rescapp busca las particiones que tienen en ellas el siguiente archivo: <i>/etc/issue</i> basandose en la informaci&oacute;n encontrada en el archivo <i>/proc/partitions</i>.
  </li>
  <li>
  <b>Paso 2</b><p></p>Si estas particiones se han encontrado Rescapp le presenta las particiones que tienen en ellas el siguiente archivo: <i>/etc/issue</i>. Al mismo tiempo se le pregunta:<p></p>
  <i>Which partition?</i><p></p>Es decir qu&eacute; partici&oacute;n es su GNU/Linux principal. Se supone que ha de elegir su partici&oacute;n GNU/Linux principal (probablemente s&oacute;lo ver&aacute; una) y pulsar el bot&oacute;n OK.
  </li>
<p></p><IMG SRC="images/grub-install_001_partition.png"><p></p>
  <li>
  <b>Paso 3</b><p></p>Rescapp busca los discos duros presentes en su sistema basandose en la informaci&oacute;n encontrada en el archivo <i>/proc/partitions</i>.
  </li>
  <li>
  <b>Paso 4</b><p></p>Se le pregunta:<p></p><i>Which hard disk to install Grub on?</i><p></p>Es decir, en qu&eacute; disco duro instalar Linux. Se supone que ha de echar un vistazo a los tama&ntilde;os de los discos duros (para poder identificar sus discos duros) y elegir (normalmente) el que est&aacute; configurado para arrancar el primero seg&uacute;n la configuraci&oacute;n de la BIOS.
  </li>
<p></p><IMG SRC="images/grub-install_002_hard_disk.png"><p></p>
  <li>
  <b>Paso 5</b><p></p>Se le muestra:<p></p><i>Order hard disks according to boot order. Press OK to continue.</i><p></p>. Eche un vistazo a los discos duros y sus tama&ntilde;os. Ordenelos de acuerdo al orden de arranque de la BIOS y pulse OK.
  </li>
<p></p><IMG SRC="images/grub-install_003_order_hard_disk.png"><p></p>
  <li>
  <b>Paso 6</b><p></p>Rescapp con toda la informaci&oacute;n obtenida va a crear un archivo device.map en su instalaci&oacute;n de Gnu/Linux (que va a ser borrada m&aacute;s tarde) e intentar&aacute; instalar grub en su disco duro seleccionado gracias al comando grub-install de la propia distribuci&oacute;n de Gnu/Linux.<b>Por favor espere</b>. Actualmente (Rescatux 0.23) este paso tarda alg&uacute;n tiempo pero no aparce ning&uacute;n mensaje que indique que hay que esperar.
  </li>
  <li>
  <b>Paso 7</b><p></p>Se le informa del proceso de instalaci&oacute;n de grub.<p></p>El mensaje se explica a s&iacute; mismo. Bien obtiene:<p></p><i>Grub was installed OK! :)</i> (Ha ido bien.)<p></p>o<p></p><i>Failure! Grub was not installed. Something went wrong! :(</i>(Algo ha ido mal)
  </li>
<p></p><IMG SRC="images/grub-install_004_sucess.png"><p></p>
  <li>
  <b>Paso 8</b><p></p>Un fichero de log llamado: <i>grub-install.log.txt</i> puede encontrarse en el directorio <i>logs</i> del escritorio.
  </li>
</ul>

<center><a href="local_doc.html"><IMG SRC="../images/go-previous.png">
  </a>
</center>
</body>
</html>