<html>
<head>
<title>Help Rescapp - Documentation</title>
</head>
<body>
<h1>Ayuda de Rescapp - Documentation</h1>

Esto es Rescapp. La interfaz de usuario principal de Rescatux.
<p></p><IMG SRC="images/help-rescapp_001_full_window.png"><p></p>
Vamos a hacer un paseo por sus opciones. La primera cosa que deber&iacute;a saber es que siempre puede volver a la primera pantalla de Rescapp gracias a la opci&oacute;n <b>MAIN MENU</b>.

<p></p><IMG SRC="images/help-rescapp_002_main_menu.png"><p></p>
Si necesitara ayuda es bueno saber que en la parte superior izquierda de la interfaz se encuentran las <b>Opciones de soporte</b>.

<ul>
  <li><b>Chat</b>: Abre la ventana de Xchat para que pueda pedir ayudar en el canal IRC de Rescatux.</li>
  <li><b>Share log</b>: Genera un pastebin de un archivo de log existente para que pueda pedir ayuda en la ventana de chat con sus datos a mano.</li>
  <li><b>Help</b>: Abre la ayuda que est&aacute; leyendo ahora por si no est&aacute; seguro de algo.</li>
</ul>
<p></p><IMG SRC="images/help-rescapp_003_support_options.png"><p></p>
Debajo de MAIN MENU y de las opciones de soporte encontrar&aacute; las <b>opciones de grupo</b>. Esto es opciones que tienen otras opciones dentro de ellas.
<p></p><IMG SRC="images/help-rescapp_004_group_options.png"><p></p>
Podr&iacute;a elegir la opci&oacute;n <b>Grub(+)</b> que le llevar&iacute;a a las opciones de Grub.
<p></p><IMG SRC="images/help-rescapp_005_grub_options.png"><p></p>
Una vez aqu&iacute;n puede ver la opci&oacute;n <b>Restore Grub</b>. Haciendo click en ella le ense&ntilde;ar&aacute; informaci&oacute;n en la parte inferior de la pantalla con apariencia de navegador web pero no la ejecutar&aacute;.
<p></p>
Si la quiere ejecutar tendr&aacute; que hacer click en el nombre de la opci&oacute;n seguida de !!!. En nuestro ejemplo tendr&iacute;a que hacer click en <b>Restore Grub !!!</b>.
<p></p><IMG SRC="images/help-rescapp_006_restore_grub_selected.png"><p></p>
Mientras navegue por las diferentes opciones le aparecer&aacute;n la opci&oacute;n <b>Back</b> que le conducir&aacute; al men&uacute; anterior.
<p></p><IMG SRC="images/help-rescapp_007_back.png"><p></p>
Ha de saber que a parte de las opciones encontradas gracias a la interfaz Rescapp hay <b>otras herramientas</b> disponibles en Rescatux. Estas herramientas se encontrar&aacute;n probablemente en el men&uacute; de inicio. Estas herramientas no est&aacute;n soportadas por el equipo de Rescatux, as&iacute; que se supone que s&oacute;lo deber&iacute;an usarlas <b>expertos</b> a&uacute;n cuando son faciles de usar.
<p></p><IMG SRC="images/help-rescapp_008_tools.png"><p></p>
Finalmente aprenderemos c&oacute;mo apagar Rescatux. El bot&oacute;n de apagado se encuentra en la esquina inferior derecha. (I dentro de O).
<p></p><IMG SRC="images/help-rescapp_009_powerdown1.png"><p></p>
Se le preguntar&aacute; qu&eacute; quiere hacer. O bien selecciona Shutdown para apagar su ordenador o reboot para usarlo inmediatamente.
<p></p><IMG SRC="images/help-rescapp_010_powerdown2.png"><p></p>
Por &uacute;ltimo se le requiere quitar su medio (cdrom o usb) de su ordenador y pulsar una tecla para continuar de tal manera que el ordenador sea apagado o reiniciado.
<p></p><IMG SRC="images/help-rescapp_011_powerdown3.png"><p></p>


<center><a href="local_doc.html"><IMG SRC="../images/go-previous.png">
  </a>
</center>

</body>
</html> 
